{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.5.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "TFDistilBertModel", "config": {"vocab_size": 30522, "max_position_embeddings": 512, "sinusoidal_pos_embds": false, "n_layers": 6, "n_heads": 12, "dim": 768, "hidden_dim": 3072, "dropout": 0.1, "attention_dropout": 0.1, "activation": "gelu", "initializer_range": 0.02, "qa_dropout": 0.1, "seq_classif_dropout": 0.2, "return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["DistilBertForMaskedLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "distilbert-base-uncased", "transformers_version": "4.28.1", "model_type": "distilbert", "tie_weights_": true}, "name": "tf_distil_bert_model", "inbound_nodes": [[["input_ids", 0, 0, {"attention_mask": ["attention_mask", 0, 0]}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tf_distil_bert_model", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 172, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_19", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 172, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-06, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of64.bin", "group1-shard2of64.bin", "group1-shard3of64.bin", "group1-shard4of64.bin", "group1-shard5of64.bin", "group1-shard6of64.bin", "group1-shard7of64.bin", "group1-shard8of64.bin", "group1-shard9of64.bin", "group1-shard10of64.bin", "group1-shard11of64.bin", "group1-shard12of64.bin", "group1-shard13of64.bin", "group1-shard14of64.bin", "group1-shard15of64.bin", "group1-shard16of64.bin", "group1-shard17of64.bin", "group1-shard18of64.bin", "group1-shard19of64.bin", "group1-shard20of64.bin", "group1-shard21of64.bin", "group1-shard22of64.bin", "group1-shard23of64.bin", "group1-shard24of64.bin", "group1-shard25of64.bin", "group1-shard26of64.bin", "group1-shard27of64.bin", "group1-shard28of64.bin", "group1-shard29of64.bin", "group1-shard30of64.bin", "group1-shard31of64.bin", "group1-shard32of64.bin", "group1-shard33of64.bin", "group1-shard34of64.bin", "group1-shard35of64.bin", "group1-shard36of64.bin", "group1-shard37of64.bin", "group1-shard38of64.bin", "group1-shard39of64.bin", "group1-shard40of64.bin", "group1-shard41of64.bin", "group1-shard42of64.bin", "group1-shard43of64.bin", "group1-shard44of64.bin", "group1-shard45of64.bin", "group1-shard46of64.bin", "group1-shard47of64.bin", "group1-shard48of64.bin", "group1-shard49of64.bin", "group1-shard50of64.bin", "group1-shard51of64.bin", "group1-shard52of64.bin", "group1-shard53of64.bin", "group1-shard54of64.bin", "group1-shard55of64.bin", "group1-shard56of64.bin", "group1-shard57of64.bin", "group1-shard58of64.bin", "group1-shard59of64.bin", "group1-shard60of64.bin", "group1-shard61of64.bin", "group1-shard62of64.bin", "group1-shard63of64.bin", "group1-shard64of64.bin"], "weights": [{"name": "dense/kernel", "shape": [768, 172], "dtype": "float32"}, {"name": "dense/bias", "shape": [172], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [172, 172], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [172], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/word_embeddings/weight", "shape": [30522, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/output_layer_norm/beta", "shape": [768], "dtype": "float32"}]}]}